[
   {
      "arabic":"الَّذِیۡنَ یُؤۡمِنُوۡنَ بِالۡغَیۡبِ وَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ  مِمَّا رَزَقۡنٰہُمۡ  یُنۡفِقُوۡنَ",
      "urdu":"جو غیب پر ایمان لاتے اور نماز کو قائم کرتے ہیں اور جو کچھ ہم نے انہیں عطا کیا ہے اس میں سے (ہماری راہ میں) خرچ کرتے ہیں۔",
      "ref":"سورة البقرة - Ayat No 3"
   },
   {
      "arabic":"یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اسۡتَعِیۡنُوۡا بِالصَّبۡرِ وَ الصَّلٰوۃِ  ؕ اِنَّ اللّٰہَ مَعَ الصّٰبِرِیۡنَ",
      "urdu":" اے ایمان والو! صبر اور نماز کے ذریعے ( مجھ سے ) مدد چاہا کرو ،  یقیناً اللہ صبر کرنے والوں کے ساتھ ( ہوتا ) ہے۔",
      "ref":"سورة البقرة - Ayat No 153 "
   },
   {
      "arabic":"وَ اسۡتَعِیۡنُوۡا بِالصَّبۡرِ وَ الصَّلٰوۃِ ؕ وَ اِنَّہَا لَکَبِیۡرَۃٌ اِلَّا عَلَی الۡخٰشِعِیۡنَ",
      "urdu":"اور صبر اور نماز کے ذریعے  ( اللہ سے )  مدد چاہو ،  اور بیشک یہ گراں ہے مگر  ( ان )  عاجزوں پر  ( ہرگز )  نہیں  ( جن کے دل محبتِ الٰہی سے خستہ اور خشیتِ الٰہی سے شکستہ ہیں )۔",
      "ref":"سورة البقرة - Ayat No 45 "
   },
   {
      "arabic":"اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَ اَقَامُوا الصَّلٰوۃَ وَ اٰتَوُا الزَّکٰوۃَ لَہُمۡ اَجۡرُہُمۡ عِنۡدَ رَبِّہِمۡ ۚ وَ لَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ  یَحۡزَنُوۡنَ",
      "urdu":"بیشک جو لوگ ایمان لائے اور انہوں نے نیک اعمال کئے اور نماز قائم رکھی اور زکوٰۃ دیتے رہے ان کے لئے ان کے رب کے پاس ان کا اجر ہے ،  اور ان پر  ( آخرت میں )  نہ کوئی خوف ہوگا اور نہ وہ رنجیدہ ہوں گے۔",
      "ref":"سورة البقرة - Ayat No 277 "
   },
   {
      "arabic":"فَاِذَا قَضَیۡتُمُ الصَّلٰوۃَ فَاذۡکُرُوا اللّٰہَ قِیٰمًا وَّ قُعُوۡدًا وَّ عَلٰی جُنُوۡبِکُمۡ ۚ فَاِذَا اطۡمَاۡنَنۡتُمۡ فَاَقِیۡمُوا الصَّلٰوۃَ ۚ اِنَّ الصَّلٰوۃَ  کَانَتۡ عَلَی الۡمُؤۡمِنِیۡنَ  کِتٰبًا مَّوۡقُوۡتًا",
      "urdu":"پھر  ( اے مسلمانو! )  جب تم نماز ادا کر چکو تو اللہ کو کھڑے اور بیٹھے اور اپنے پہلوؤں پر  ( لیٹے ہر حال میں )  یاد کرتے رہو ،  پھر جب تم  ( حالتِ خوف سے نکل کر )  اطمینان پالو تو نماز کو  ( حسبِ دستور )  قائم کرو ۔  بیشک نماز مومنوں پر مقررہ وقت کے حساب سے فرض ہے۔",
      "ref":"سورة النساء - Ayat No 103 "
   },
   {
      "arabic":"اِنَّمَا وَلِیُّکُمُ اللّٰہُ وَ رَسُوۡلُہٗ وَ الَّذِیۡنَ اٰمَنُوا الَّذِیۡنَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ یُؤۡتُوۡنَ  الزَّکٰوۃَ  وَ ہُمۡ  رٰکِعُوۡنَ",
      "urdu":"بیشک تمہارا  ( مددگار )  دوست تو اللہ اور اس کا رسول  ( صلی اللہ علیہ وآلہ وسلم )  ہی ہے اور  ( ساتھ )  وہ ایمان والے ہیں جو نماز قائم رکھتے ہیں اور زکوٰۃ ادا کرتے ہیں اور وہ  ( اللہ کے حضور عاجزی سے )  جھکنے والے ہیں۔",
      "ref":"سورة المائدة - Ayat No 55 "
   },
   {
      "arabic":"وَ الۡمُؤۡمِنُوۡنَ وَ الۡمُؤۡمِنٰتُ بَعۡضُہُمۡ اَوۡلِیَآءُ بَعۡضٍ ۘ یَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَ یَنۡہَوۡنَ عَنِ الۡمُنۡکَرِ وَ یُقِیۡمُوۡنَ الصَّلٰوۃَ  وَ یُؤۡتُوۡنَ الزَّکٰوۃَ وَ یُطِیۡعُوۡنَ اللّٰہَ وَ رَسُوۡلَہٗ ؕ اُولٰٓئِکَ سَیَرۡحَمُہُمُ اللّٰہُ ؕ اِنَّ اللّٰہَ عَزِیۡزٌ  حَکِیۡمٌ",
      "urdu":"اور اہلِ ایمان مرد اور اہلِ ایمان عورتیں ایک دوسرے کے رفیق و مددگار ہیں ۔  وہ اچھی باتوں کا حکم دیتے ہیں اور بری باتوں سے روکتے ہیں اور نماز قائم رکھتے ہیں اور زکوٰۃ ادا کرتے ہیں اور اللہ اور اس کے رسول  ( صلی اللہ علیہ وآلہ وسلم )  کی اطاعت بجا لاتے ہیں ،  ان ہی لوگوں پر اللہ عنقریب رحم فرمائے گا ،  بیشک اللہ بڑا غالب بڑی حکمت والا ہے۔",
      "ref":"سورة التوبة - Ayat No 71 "
   }
]