[
   {
      "arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى ، قَالَ : أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ ، عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :    بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ ، شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ، وَإِقَامِ الصَّلَاةِ ، وَإِيتَاءِ الزَّكَاةِ ، وَالْحَجِّ ، وَصَوْمِ رَمَضَانَ ",
      "urdu":"رسول اللہ ﷺ نے فرمایا اسلام کی بنیاد پانچ چیزوں پر قائم کی گئی ہے ۔ اول گواہی دینا کہ اللہ کے سوا کوئی معبود نہیں اور بیشک حضرت محمد ﷺ اللہ کے سچے رسول ہیں اور نماز قائم کرنا اور زکوٰۃ ادا کرنا اور حج کرنا اور رمضان کے روزے رکھنا ۔",
      "ref":"Sahih Bukhari#8"
   },
   {
      "arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، قَالَ : حَدَّثَنَا يَحْيَى ، قَالَ : حَدَّثَنَا إِسْمَاعِيلُ ، قَالَ : حَدَّثَنَا قَيْسٌ ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ ، قَالَ :    بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى إِقَامِ الصَّلَاةِ ، وَإِيتَاءِ الزَّكَاةِ ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ",
      "urdu":" میں نے رسول اللہ ﷺ کے دست مبارک پر نماز قائم کرنے ، زکوٰۃ دینے ، اور ہر مسلمان کے ساتھ خیر خواہی کرنے پر بیعت کی ۔",
      "ref":"Sahih Bukhari#524"
   },
   {
      "arabic":"حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ وَالْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا قَالَ تَشْهَدُهُ مَلَائِكَةُ اللَّيْلِ وَالنَّهَارِ",
      "urdu":" حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے آیات کریمہ : ﴿ وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا ﴾ ’’ اور فجر کی تلاوت ، یقیناً فجر کی نماز میں ۔۔۔۔۔۔۔۔ فرشتے ۔۔۔۔۔۔۔۔ حاضر ہوتے ہیں ۔‘‘ کی وضاحت کرتے ہوئے فرمایا :’’ اس میں رات اور دن کے فرشتے حاضر ہوتے ہیں ۔",
      "ref":"Sunan Ibn e Majah#670"
   },
   {
      "arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الَّذِي تَفُوتُهُ صَلَاةُ الْعَصْرِ فَكَأَنَّمَا وُتِرَ أَهْلُهُ وَمَالُهُ",
      "urdu":" حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے ، اللہ کے رسول ﷺ نے فرمایا :’’ جس کی عصر کی نماز فوت ہو گئی گویا اس کے اہل و عیال اور مال و دولت ( سب کچھ ) تباہ و برباد ہو گئے ۔",
      "ref":"Sunan Ibn e Majah#685"
   },
   {
      "arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَخَّرْتُ صَلَاةَ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ أَوْ نِصْفِ اللَّيْلِ",
      "urdu":" حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، رسول اللہ ﷺ نے فرمایا :’’ اگر مجھے اپنی امت پر مشقت کا خوف نہ ہوتا تو میں عشاء کی نماز کو تہائی رات یا نصف رات تک مؤخر کرتا ۔",
      "ref":"Sunan Ibn e Majah#691"
   },
   {
      "arabic":"حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا",
      "urdu":" حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے ، رسول اللہ ﷺ نے فرمایا :’’ جو شخص کوئی نماز پڑھنا بھول جائے تو اسے چاہیے کہ جب اسے یاد آئے ، پڑھ لے ۔",
      "ref":"Sunan Ibn e Majah#696"
   },
   {
      "arabic":"حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ الْعُمَرِيِّ، عَنْ الْقَاسِمِ بْنِ غَنَّامٍ، عَنْ عَمَّتِهِ أُمِّ فَرْوَةَ، وَكَانَتْ مِمَّنْ بَايَعَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّ الْأَعْمَالِ أَفْضَلُ ؟ قَالَ:‏‏‏‏    الصَّلَاةُ لِأَوَّلِ وَقْتِهَا ",
      "urdu":" نبی اکرم صلی الله علیہ وسلم سے پوچھا گیا: کون سا عمل سب سے افضل ہے؟ تو آپ ﷺ نے فرمایا: ”اول وقت میں نماز پڑھنا“۔ ",
      "ref":"Sunan Tirmizi#170"
   }
]